{
  "backend/main.mo": "Defines the canister actor with extensive data types for blog posts, store items, meetings, MP3 tracks, livestreams, links, analytics, and homepage content, and initializes multiple storage maps.",
  "backend/migration.mo": "Adds a new dailyVisitors map to analytics data during migration by extending the old actor state.",
  "feature_evidence.json": "Lists feature evidence for analytics updates, daily visitor tracking, and corresponding frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose of key frontend files across the app.",
  "frontend/index.html": "Base HTML file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Configures the app’s router, theme provider, Internet Identity provider, and React Query client with routes for home and admin.",
  "frontend/src/components/admin/AnalyticsManagement.tsx": "Displays analytics fetched from the backend and renders multiple charts and summaries for visits, clicks, section views, and daily visitors.",
  "frontend/src/components/admin/BlogManagement.tsx": "Provides UI to create, list, edit, and delete blog posts including image uploads and markdown insertion.",
  "frontend/src/components/admin/EBookManagement.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/admin/LinksManagement.tsx": "Manages creation, editing, deletion, ordering, and visibility of link buttons with validation and confirmation dialogs.",
  "frontend/src/components/admin/LivestreamManagement.tsx": "Handles creation, editing, visibility toggling, and deletion of livestream entries with date/time handling and form validation.",
  "frontend/src/components/admin/MeetingManagement.tsx": "Allows admins to create meeting slots and view existing appointments and slots with date/time conversion and validation.",
  "frontend/src/components/admin/Mp3PlayerManagement.tsx": "Admin UI for creating playlists, uploading MP3 tracks with metadata, toggling visibility, deleting tracks, and reordering them.",
  "frontend/src/components/admin/PageManagement.tsx": "Manages homepage sections including creation, editing, deletion, reordering, and visibility toggling.",
  "frontend/src/components/admin/StoreItemManagement.tsx": "Form-driven admin tool for adding store items with images, pricing, product types, and previews.",
  "frontend/src/components/BlogPostModal.tsx": "Displays a blog post in a modal with rich content rendering and admin inline editing support.",
  "frontend/src/components/BlogSection.tsx": "Fetches and displays blog posts in a grid with editable section headers and click-tracking analytics.",
  "frontend/src/components/BookingModal.tsx": "Modal for booking a meeting slot, handling name input, date formatting, and async appointment creation with success/error toasts.",
  "frontend/src/components/CustomSection.tsx": "Wrapper section that renders a homepage section and enables admin editing via EditableCustomSection.",
  "frontend/src/components/EBookSection.tsx": "Empty component file with no implementation.",
  "frontend/src/components/EditableCustomSection.tsx": "Admin-editable homepage section allowing title and description editing with save/cancel logic and mutation calls.",
  "frontend/src/components/EditableSection.tsx": "Generic editable section for various site content keys, supporting admin editing and saving updated titles and descriptions.",
  "frontend/src/components/Footer.tsx": "Footer component displaying site footer content with admin edit mode for updating the footer text.",
  "frontend/src/components/Header.tsx": "Header with authentication, admin quick-edit support, and editable business title handling via mutations.",
  "frontend/src/components/InlineEditBlogPost.tsx": "Inline blog post editor with autosave, manual save, file uploads (including image markdown insertion), and delete dialog handling.",
  "frontend/src/components/InlineEditEBook.tsx": "Provides inline editing for eBook store items with auto‑save after inactivity and manual save validation.",
  "frontend/src/components/InlineEditLink.tsx": "Enables editing, auto‑saving, and deletion of link items with URL validation and admin controls.",
  "frontend/src/components/InlineEditLivestream.tsx": "Handles inline editing of livestream details including scheduling, auto‑save, manual save, and deletion.",
  "frontend/src/components/InlineEditMeetingSlot.tsx": "Supports editing meeting slot descriptions with change detection, auto‑save, and manual save actions.",
  "frontend/src/components/InlineEditStoreItem.tsx": "Allows editing generic store items with auto‑save, manual save, and product type handling.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with header, footer, routed content, and conditional profile setup modal.",
  "frontend/src/components/LinksSection.tsx": "Renders a list of external links with admin editing support, visibility filtering, and click tracking.",
  "frontend/src/components/LivestreamSection.tsx": "Displays livestream cards with date/time formatting, admin‑only visibility, and external link tracking.",
  "frontend/src/components/MeetingSection.tsx": "Shows bookable meeting slots, opens a booking modal, and tracks user interactions.",
  "frontend/src/components/Mp3PlayerSection.tsx": "Implements an audio player with playlists, playback controls, looping, and play‑count tracking.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving a user's name and email with validation and toast feedback.",
  "frontend/src/components/QuickEditOverlay.tsx": "Admin search-and-edit overlay allowing quick filtering and inline editing across multiple content types.",
  "frontend/src/components/StoreItemSection.tsx": "Displays store items with product type labels, image previews, and click‑tracking for analytics.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor methods for CRUD operations across blog posts, store items, homepage sections, mp3 data, and other app entities.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme color variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with authentication checks and tabbed management sections for site content.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage sections dynamically and tracks visits, section views, and unique visitors.",
  "frontend/src/utils/dailyVisitorTracking.ts": "Provides helpers for generating visitor session IDs and tracking daily visits using localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and persisting URL parameters using URL parsing and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme variables, colors, animations, and plugins.",
  "project_state.json": "Stores overall project state including versioning, a high-level system summary, and a list of defined features with metadata. Acts as a structured registry of implemented functionality across the website/CMS."
}