{
  "backend/main.mo": "Main backend actor defining types (BlogPost, StoreItem, MeetingSlot, Appointment, Livestream, Mp3Track, etc.) and storage maps for blog posts, store items, meetings, appointments, analytics, MP3 tracks, playlists, and site content with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three features: adding reload and reset buttons to AnalyticsManagement component, and simplifying the component code for better reliability and maintainability.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App.tsx with router setup, useQueries hooks for backend operations, HomePage with analytics tracking, admin dashboard, blog/eBook/meeting sections, modals, and German-localized UI components.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the React application.",
  "frontend/src/App.tsx": "Root React component configuring QueryClient with 5-minute stale time, TanStack Router with home and admin routes, ThemeProvider, InternetIdentityProvider, and Toaster for notifications.",
  "frontend/src/components/admin/AnalyticsManagement.tsx": "Admin analytics dashboard displaying page visits, element clicks, section views, and daily visitor trends using bar and pie charts. Includes reload and reset functionality with German localization.",
  "frontend/src/components/admin/BlogManagement.tsx": "Admin component for creating, listing, and deleting blog posts with image upload support via ExternalBlob and markdown insertion.",
  "frontend/src/components/admin/EBookManagement.tsx": "Empty file with no content.",
  "frontend/src/components/admin/LinksManagement.tsx": "Admin component for managing external links with add, delete, reorder, and visibility toggle functionality.",
  "frontend/src/components/admin/LivestreamManagement.tsx": "Admin component for managing livestream events with CRUD operations, visibility toggling, and scheduling via date/time inputs.",
  "frontend/src/components/admin/MeetingManagement.tsx": "Admin component for creating meeting time slots with date, time, duration, and optional description fields, plus listing all appointments and slots.",
  "frontend/src/components/admin/Mp3PlayerManagement.tsx": "Admin component for managing playlists and MP3 tracks with upload via ExternalBlob, reordering, visibility toggling, and deletion with progress tracking.",
  "frontend/src/components/admin/PageManagement.tsx": "Admin component for managing homepage sections with CRUD operations, reordering, and visibility toggling. Uses custom hooks for API calls and displays sections with controls for adding, editing, deleting, and rearranging content blocks.",
  "frontend/src/components/admin/StoreItemManagement.tsx": "Admin component for creating and managing store items with support for multiple product types (eBook, clothing, other), pricing, cover images, and preview images. Handles file uploads and converts them to ExternalBlob format for backend storage.",
  "frontend/src/components/BlogPostModal.tsx": "Modal dialog displaying full blog post content with preserved formatting, German date formatting, admin edit button to switch to inline editing mode, and image rendering from markdown syntax.",
  "frontend/src/components/BlogSection.tsx": "Blog section component displaying blog posts in a card grid with German date formatting, editable title/description for admins, click tracking for analytics, and loading states.",
  "frontend/src/components/BookingModal.tsx": "Modal form for booking appointments with customer name input, German-formatted date/time display, form validation, and mutation handling with success/error toasts.",
  "frontend/src/components/CustomSection.tsx": "Component rendering custom homepage sections with admin-only inline editing capability via EditableCustomSection component.",
  "frontend/src/components/EBookSection.tsx": "Section component for displaying eBooks with cover images, descriptions, EUR pricing, editable title/description for admins, and analytics click tracking.",
  "frontend/src/components/EditableCustomSection.tsx": "Renders a homepage section with inline editing for admins, allowing title and description updates with save/cancel actions and toast notifications.",
  "frontend/src/components/EditableSection.tsx": "Provides inline editing for predefined site content sections (blog, store, meeting, etc.) with admin-only edit mode and save/cancel functionality.",
  "frontend/src/components/Footer.tsx": "Displays a footer with editable content for admins, including a default attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Main navigation header with Internet Identity authentication, admin dropdown menu, editable business title, and quick edit overlay toggle.",
  "frontend/src/components/InlineEditBlogPost.tsx": "Inline blog post editor with auto-save after 2 seconds of inactivity, file upload support for images, and delete confirmation dialog.",
  "frontend/src/components/InlineEditEBook.tsx": "Inline store item editor with auto-save functionality, price validation in cents, and availability toggle for e-books.",
  "frontend/src/components/InlineEditLink.tsx": "Inline editor for link items with auto-save (2s debounce), manual save, delete confirmation dialog, and URL validation. Shows save status and provides German-language toast notifications.",
  "frontend/src/components/InlineEditLivestream.tsx": "Inline editor for livestream items with auto-save, manual save, delete dialog, and fields for title, description, external link, button label, start date/time, and visibility. Converts timestamps to/from BigInt nanoseconds.",
  "frontend/src/components/InlineEditMeetingSlot.tsx": "Inline editor for meeting slots with auto-save (2s debounce) and manual save. Edits description only; displays formatted date/time and shows live save status with last-saved timestamp.",
  "frontend/src/components/InlineEditStoreItem.tsx": "Inline editor for store items with auto-save (2s debounce) for title, description, and price (converted to/from cents as BigInt). Shows save status and provides manual save/cancel actions.",
  "frontend/src/components/Layout.tsx": "Root layout component with header, footer, and main content outlet. Conditionally renders ProfileSetupModal for authenticated users without a profile.",
  "frontend/src/components/LinksSection.tsx": "Displays a grid of external links with click tracking. Shows editable title/description for admins and filters visible links based on admin status.",
  "frontend/src/components/LivestreamSection.tsx": "Displays livestream cards with formatted date/time, click tracking, and external link buttons. Highlights newest livestream with blue ring and filters by visibility for non-admins.",
  "frontend/src/components/MeetingSection.tsx": "Displays available meeting slots in a grid of cards with date, time, and booking functionality. Includes an editable title/description section and a modal for booking selected slots.",
  "frontend/src/components/Mp3PlayerSection.tsx": "Full-featured audio player component with playlist selection, playback controls, volume/mute, loop modes, progress slider, and play count tracking. Supports multiple playlists and tracks with metadata display.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name and email input. Cannot be dismissed and saves profile data via mutation hook.",
  "frontend/src/components/QuickEditOverlay.tsx": "Admin overlay with tabbed interface for quick editing of blog posts, store items, meeting slots, livestreams, and links. Includes search functionality and inline edit components for each content type.",
  "frontend/src/components/StoreItemSection.tsx": "Displays store items (eBooks, clothing, etc.) in a grid with cover images, product type labels, pricing, and preview image functionality. Includes editable section header and click tracking.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes due to authentication state updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Configures AuthClient with custom options including derivation origin and idle behavior.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend API operations including blog posts, store items, meetings, appointments, user profiles, site content, homepage sections, analytics, MP3 tracks, playlists, livestreams, and links. Provides both query and mutation hooks with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using OKLCH color space. Defines design tokens for backgrounds, foregrounds, borders, charts, and sidebar components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component. Configures the provider hierarchy for authentication and data fetching.",
  "frontend/src/pages/AdminDashboard.tsx": "Main admin dashboard page with tabbed interface for managing blog, store, meetings, MP3, livestream, links, pages, and analytics. Includes authentication check and quick edit overlay.",
  "frontend/src/pages/HomePage.tsx": "Homepage that dynamically renders sections based on backend configuration, tracks page visits and unique daily visitors, and displays blog posts in a modal.",
  "frontend/src/utils/dailyVisitorTracking.ts": "Utility functions for tracking daily unique visitors using localStorage to store session IDs and last tracked dates with safe fallbacks.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both hash-based and browser routing, with sessionStorage persistence and parameter cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended animations, container settings, and typography/animation plugins.",
  "project_state.json": "Project state tracking document indicating pending features for adding reload and reset buttons to AnalyticsManagement component, with known build failure issues."
}