{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add reset and reload buttons to analytics panel",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a reload button to the AnalyticsManagement component that refetches all analytics data from the backend when clicked",
      "acceptanceCriteria": [
        "Reload button is visible in the analytics panel header",
        "Clicking reload button triggers a refetch of analytics data",
        "Loading state is shown during reload operation",
        "Success feedback is provided after reload completes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AnalyticsManagement.tsx",
          "operation": "modify",
          "description": "Add a reload button to the component header that calls the refetch function from the useGetAnalyticsData hook. Display a loading spinner icon during refetch operation. Show a success toast notification after reload completes using toast from sonner. Position the reload button in the header alongside existing analytics title."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the useGetAnalyticsData hook returns the refetch function and isRefetching state from useQuery to support manual data reloading. Verify the query configuration allows manual refetching."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a reset button to the AnalyticsManagement component that clears all analytics data in the backend and refreshes the display",
      "acceptanceCriteria": [
        "Reset button is visible in the analytics panel header",
        "Clicking reset shows a confirmation dialog before proceeding",
        "Reset action calls backend method to clear analytics data",
        "Frontend display updates to show cleared state after successful reset",
        "Error handling is implemented if reset fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AnalyticsManagement.tsx",
          "operation": "modify",
          "description": "Add a reset button to the component header that opens a confirmation dialog using AlertDialog from shadcn/ui before clearing analytics. Implement the reset flow using useMutation to call actor.clearAnalyticsData(), followed by invalidating the analytics query to refresh the display. Show loading state during reset operation. Display success toast on completion and error toast on failure. Position the reset button in the header next to the reload button with appropriate destructive styling."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new useClearAnalyticsData mutation hook that wraps actor.clearAnalyticsData(). Configure the mutation to invalidate the analytics query key on success to trigger automatic refetch of cleared data. Include proper error handling and return mutation states for UI feedback."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Review and simplify the AnalyticsManagement component code to improve reliability and maintainability",
      "acceptanceCriteria": [
        "Remove any redundant or duplicate code in AnalyticsManagement.tsx",
        "Ensure consistent error handling patterns across all analytics operations",
        "Simplify complex conditional logic where possible",
        "Verify all data fetching operations have proper loading and error states"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AnalyticsManagement.tsx",
          "operation": "modify",
          "description": "Review and refactor the component to remove any redundant code, consolidate repeated logic into helper functions if needed, and ensure consistent error handling using try-catch blocks with toast notifications. Simplify conditional rendering logic for loading and error states. Verify that all chart components and data transformations handle edge cases properly (empty arrays, null values). Ensure the component follows React best practices with proper dependency arrays in useEffect hooks if any exist."
        }
      ]
    }
  ]
}